tap "koekeishiya/formulae"
brew "bat"
brew "bitwarden-cli"
brew "btop"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "git-delta"
brew "jq"
brew "lazygit"
brew "ripgrep"
brew "tealdeer"
brew "tmux"
brew "zoxide"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
cask "font-hack-nerd-font"
